src/ex_Tabakon/Documents/ЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ЗаказПокупателя</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаПродажи</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отменено</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкиРассчитаны</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДисконтнойКарты</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйКодСтроки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеНезарезервированныхСтрок</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтернетЗаказ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаказаНаСайте</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаказаНаСайте</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетОрганизации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентТелефон</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентТелефонЗначение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАвтоматическойСкидки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Резервировать</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продавец</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентАвтоматическойСкидки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменено</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтмены</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаказовПокупателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подарки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаНаценка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СкидкиНаценки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкидкаНаценка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТБКСогласоватьПосле(Команда)
	Если Объект.Статус	=	ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПокупателей.Согласован") тогда
		Сообщить("Заказ уже согласован!");
		Возврат          	
	КонецЕсли;

	
	ТекстВопроса = НСтр("ru='Заказ полностью подготовлен?'");
	ОбработчикОповещения = Новый ОписаниеОповещения("ТБКСогласовать", ЭтотОбъект);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);   	


КонецПроцедуры

&НаКлиенте
Процедура ТБКСогласовать(Результат, ДополнительныеПараметры) экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Статус							=	ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПокупателей.Согласован");
		Объект.НаличиеНезарезервированныхСтрок	= Истина; //  метка, чтобы понимать отправлено изменение по заказу в розницу или нет
		Записать();
		Закрыть();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТБКВыкуплен(Результат, ДополнительныеПараметры) экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Статус	=	ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПокупателей.Закрыт");
		Объект.НаличиеНезарезервированныхСтрок	= Истина; //  метка, чтобы понимать отправлено изменение по заказу в розницу или нет 
		Записать();
		Закрыть();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТБКВыкупленПосле(Команда)
	ТекстВопроса = НСтр("ru='Заказ полностью выкуплен?'");
	ОбработчикОповещения = Новый ОписаниеОповещения("ТБКВыкуплен", ЭтотОбъект);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет); 

КонецПроцедуры


&НаКлиенте
Процедура ТБКОплатить(Команда)
	Если Модифицированность Тогда 
		Попытка
			ПараметрыЗаписи = Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись);
			Записать(ПараметрыЗаписи); 			
	Исключение
			ТекстСообщения = НСтр("ru = 'Документ невозможно записать'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
	КонецЕсли;	
	
	ТекстВопроса = НСтр("ru='Перейти к оплате зкааза?'");
	ОбработчикОповещения = Новый ОписаниеОповещения("ПеренестиВРМК", ЭтотОбъект);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);  
	
КонецПроцедуры


&НаКлиенте
Процедура ТБКПриОткрытииПосле(Отказ)
	УстановитьВидимостьКнопок();
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимостьКнопок()
	флМожноПробивать = ПроверитьМожноПробивать(Объект.Ссылка);
	
	Элементы.ФормаОплатить.Доступность   		=  флМожноПробивать; 
	
	Если не ОбщегоНазначенияВызовСервера.ПроверитьВозможностьРедактирования_Общая() тогда
		Элементы.Статус.ТолькоПросмотр	=	Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьМожноПробивать(Ссылка)
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ЧекККМТовары.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	      	 	             |ГДЕ
	      	 	             |	ЧекККМТовары.ЗаказПокупателя = &ЗаказПокупателя
	      	 	             |	И ЧекККМТовары.Ссылка.Проведен");
	Запрос.УстановитьПараметр("ЗаказПокупателя",Ссылка);
	
	Возврат Запрос.Выполнить().Пустой(); 
КонецФункции

&НаКлиенте
Процедура ТБКОтвязатьЧекПосле(Команда)
	Пароль = "";
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводСтроки", ЭтаФорма);
	ПоказатьВводСтроки(ОписаниеОповещения, Пароль, "Введите пароль: "); 
КонецПроцедуры

&НаКлиенте
Процедура ВводСтроки(ПолученноеЗначение, ПереданныеПараметры) Экспорт
	Если ПолученноеЗначение = "0000" тогда 
		ТБКОтвязатьЧекПослеНаСервере(Объект.Ссылка);
		УстановитьВидимостьКнопок();
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТБКОтвязатьЧекПослеНаСервере(Ссылка)
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ЧекККМТовары.Ссылка КАК Ссылка
	      	 	             |ИЗ
	      	 	             |	Документ.ЧекККМ.Товары КАК ЧекККМТовары
	      	 	             |ГДЕ
	      	 	             |	ЧекККМТовары.ЗаказПокупателя = &ЗаказПокупателя
	      	 	             |	И ЧекККМТовары.Ссылка.Проведен");
	Запрос.УстановитьПараметр("ЗаказПокупателя",Ссылка);
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 тогда
		Сообщить("К этому документу нет чеков!");
	КонецЕсли;
	
	Для каждого Строка из рез цикл
		Об = Строка.Ссылка.ПолучитьОбъект();
		Для каждого Строка из Об.товары цикл
			Строка.ЗаказПокупателя	=	Документы.ЗаказПокупателя.ПустаяСсылка();
		КонецЦикла;
			
		Об.ДополнительныеСвойства.Вставить("ЗагрузкаДанныхИзРабочегоМеста",истина);
		Об.Записать(РежимЗаписиДокумента.ОтменаПроведения);

		Сообщить("Выполнено успешно!");
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиВРМК(Результат, ДополнительныеПараметры) экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Элементы.ФормаОплатить.Доступность   = Ложь; 
		
		Объект.Статус	=	ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПокупателей.Закрыт");
		Объект.НаличиеНезарезервированныхСтрок	= Истина; //  метка, чтобы понимать отправлено изменение по заказу в розницу или нет 
		
		ОкнаПриложения = ПолучитьОкна();
		Для каждого ОкноПриложения Из ОкнаПриложения Цикл
			// Анализ заголовка окна
			//Закрываем окна с заказами
			Если Найти(ОкноПриложения.Заголовок,"Заказ") Тогда
				НайденнаяФорма = ОкноПриложения.Содержимое[0];
				НайденнаяФорма.Закрыть();
			КонецЕсли;
			
			
			Если ОкноПриложения.Заголовок = "" или ОкноПриложения.Заголовок = "*" Тогда
				НужныйСклад		 =	ПолучитьСклад();

				
				НайденнаяФорма = ОкноПриложения.Содержимое[0];
				НайденнаяФорма.Объект.Товары.очистить();
				
				НужныйСклад		 =	ПолучитьСклад();
				НужнаяОрг		 =	НайденнаяФорма.Объект.Организация;
				НужаяСНО		=	ПолучитьВидНалогаСервер(НужнаяОрг);
				Для каждого Строка из Объект.Товары цикл
					НоваяСтрока	=	НайденнаяФорма.Объект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
					НоваяСтрока.Склад			=	НужныйСклад;
					НоваяСтрока.Организация		=	НужнаяОрг;
					НоваяСтрока.ЗаказПокупателя	=	Объект.Ссылка;
					НоваяСтрока.СтавкаНДС		=	ПолучитьСтавкуБезНДС();
					НоваяСтрока.ВидНалога		=	НужаяСНО;
					Если ЭтоМаркированнаяНоменклатура(НоваяСтрока.Номенклатура) тогда
						НоваяСтрока.НеобходимостьВводаАкцизнойМарки	=	истина;
						НоваяСтрока.СтатусПроверкиГосИС 			= 2;
						НоваяСтрока.ВидПродукцииИС					= ПолучитьВидТабак();
						НоваяСтрока.МаркируемаяПродукция			= Истина;  
					КонецЕсли;
				КонецЦикла;
				
				НайденнаяФорма.Активизировать();
				Возврат;			
				
			КонецЕсли;
		КонецЦикла; 
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПолучитьСклад()
	Возврат ОбщегоНазначения.ПолучитьСкладИзООРП();
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоМаркированнаяНоменклатура(Номенклатура)
	возврат Найти(Номенклатура.ВидНоменклатуры.Наименование,"Табак (х)") или Номенклатура.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция;	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидТабак()
	Возврат Перечисления.ВидыПродукцииИС.Табачная;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтавкуБезНДС()
	Возврат Перечисления.СтавкиНДС.БезНДС;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидНалогаСервер(НужнаяОрг)
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ПрименениеСистемНалогообложенияСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ПрименениеСистемНалогообложения.СрезПоследних КАК ПрименениеСистемНалогообложенияСрезПоследних
	      	 	             |ГДЕ
	      	 	             |	ПрименениеСистемНалогообложенияСрезПоследних.Организация = &Организация");
	Запрос.УстановитьПараметр("Организация",НужнаяОрг);
	
	Рез = Запрос.Выполнить().Выгрузить();
	Если рез.Количество() = 0 тогда
		Сообщить("Внимание! Не найдена система налогооблажения!");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат рез[0].СистемаНалогообложения;
	
КонецФункции

&НаСервере
Процедура ТБКПередЗаписьюНаСервереВместо(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ТБКСтатусПриИзмененииПосле(Элемент)
	Объект.НаличиеНезарезервированныхСтрок 	= Истина;
КонецПроцедуры

//Марк 28.07.2023
&НаСервере
Процедура ТБКПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ПриЗаписиПерепроводить = Ложь;
	Объект.НаличиеНезарезервированныхСтрок = Истина;
	//ЭтотОбъект.КоманднаяПанель.ПодчиненныеЭлементы.ФормаПровестиИЗакрыть.Видимость = Ложь;
	объект.ЖелаемаяДатаПродажи = '00010101';
	Если НЕ Объект.Магазин.Пустая() Тогда

		Объект.Склад = объект.Магазин.СкладПродажи;
		Объект.Организация = Объект.Склад.Организация;
	
	КонецЕсли;
	
	Объект.Продавец = Объект.Ответственный.ФизическоеЛицо;
	
КонецПроцедуры

Функция ПроверкаРеквизитовДляЗаписи()
	
	Если  НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен склад!";
		Сообщение.Поле = "Склад";
		Сообщение.УстановитьДанные(Объект.Склад);
		Сообщение.Сообщить();
		Возврат Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Магазин) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен магазин!";
		Сообщение.Поле = "Магазин";
		Сообщение.УстановитьДанные(Объект.Магазин);
		Сообщение.Сообщить();
		Возврат Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена организация!";
		Сообщение.Поле = "Организация";
		Сообщение.УстановитьДанные(Объект.Организация);
		Сообщение.Сообщить();
		Возврат Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(Телефон) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен телефон клиента!";
		Сообщение.Поле = "Телефон";
		Сообщение.УстановитьДанные(Телефон);
		Сообщение.Сообщить();
		Возврат Истина;
	ИначеЕсли Элементы.Телефон.РасширеннаяПодсказка.Заголовок = "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнено имя клиента!";
		Сообщение.Поле = "Имя";
		Сообщение.УстановитьДанные(Телефон);
		Сообщение.Сообщить();
		Возврат Истина;
	ИначеЕсли Объект.Товары.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет товаров";
		Сообщение.Поле = "Товары";
		Сообщение.УстановитьДанные(Объект.Товары);
		Сообщение.Сообщить();
		Возврат Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Продавец) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен продавец";
		Сообщение.Поле = "Продавец";
		Сообщение.УстановитьДанные(Объект.Продавец);
		Сообщение.Сообщить();
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ТБКПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	Отказ = ПроверкаРеквизитовДляЗаписи();
КонецПроцедуры


&НаКлиенте
Процедура ТБКЗаписатьИЗакрытьПосле(Команда)
	Записать();
	Закрыть();
КонецПроцедуры
//КонецМарк
